In [1]:
# pip install pandas

In [3]:
import pandas as pd

In [4]:
series = pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

In [6]:
li = [1,2,3,4,5]
ser = pd.Series(li)
print(ser)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
li = ['a','b','c']
ser = pd.Series(li)
print(ser)

0    a
1    b
2    c
dtype: object

In [8]:
dic = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(dic)
print(ser)

a    1
b    2
c    3
dtype: int64

In [9]:
# datatype
series = pd.Series([1,2,3,4], dtype = 'float16')
print(series)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float16

In [10]:
series.dtype

dtype('float16')

In [12]:
series = pd.Series([1,2,3,4], index = [55,22,77,99], dtype = 'float16')
print(series)

55    1.0
22    2.0
77    3.0
99    4.0
dtype: float16

In [15]:
series = pd.Series([1,2,3,4], index = [55,22,77,99])
print(series[55])

1

In [16]:
print(series[99])

4

In [17]:
series = pd.Series([1,2,3,4,5])
print(series[0:3])

0    1
1    2
2    3
dtype: int64

In [18]:
print(series[2:4])

2    3
3    4
dtype: int64

In [19]:
print(series[:3:2])

0    1
2    3
dtype: int64

In [20]:
print(series[:4])

0    1
1    2
2    3
3    4
dtype: int64

In [21]:
# DataFrame

In [22]:
df = pd.DataFrame([1,2,3,4])
print(df)

   0
0  1
1  2
2  3
3  4

In [23]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [24]:
df = pd.DataFrame([])
print(df)

Empty DataFrame
Columns: []
Index: []

In [25]:
df

Empty DataFrame
Columns: []
Index: []

In [26]:
df = pd.DataFrame([1,2,3,4])
df

   0
0  1
1  2
2  3
3  4

In [27]:
data = [['Bob', 12], ['Sam', 20], ['Alex', 15]]
df = pd.DataFrame(data)
df

      0   1
0   Bob  12
1   Sam  20
2  Alex  15

In [28]:
data = [['Bob', 12], ['Sam', 20], ['Alex', 15]]
df = pd.DataFrame(data, columns = ['Name', 'Age'])
df

   Name  Age
0   Bob   12
1   Sam   20
2  Alex   15

In [29]:
data = {'Name': ['Tom', 'Jack', 'Steve'], 'Age': [14, 11, 20]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   14
1   Jack   11
2  Steve   20

In [30]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10}]
df = pd.DataFrame(data)
df

   a   b
0  1   2
1  5  10

In [31]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10}]
df = pd.DataFrame(data, index = ['First Row', 'Sec Row'])
df

           a   b
First Row  1   2
Sec Row    5  10

In [32]:
data = {'First_Col': pd.Series([1,2,3], index = ['a', 'b', 'c']), 'Sec_Col': pd.Series([4,5,6], index = ['a', 'b', 'c'])}
df = pd.DataFrame(data)
df

   First_Col  Sec_Col
a          1        4
b          2        5
c          3        6

In [33]:
df['Third_Col']= df['First_Col'] + df['Sec_Col']
df

   First_Col  Sec_Col  Third_Col
a          1        4          5
b          2        5          7
c          3        6          9

In [34]:
df['Fourth_Col'] = df['First_Col'] + df['Third_Col']
df

   First_Col  Sec_Col  Third_Col  Fourth_Col
a          1        4          5           6
b          2        5          7           9
c          3        6          9          12

In [35]:
df['Fourth_Col']

a     6
b     9
c    12
Name: Fourth_Col, dtype: int64

In [36]:
# loc Function

In [43]:
df

   First_Col  Sec_Col  Third_Col  Fourth_Col
a          1        4          5           6
b          2        5          7           9
c          3        6          9          12

In [39]:
print(df.loc['b'])

First_Col     2
Sec_Col       5
Third_Col     7
Fourth_Col    9
Name: b, dtype: int64

In [40]:
print(df.loc['c'])

First_Col      3
Sec_Col        6
Third_Col      9
Fourth_Col    12
Name: c, dtype: int64

In [41]:
# iloc Function -> Integer Location

In [42]:
print(df.iloc[1])

First_Col     2
Sec_Col       5
Third_Col     7
Fourth_Col    9
Name: b, dtype: int64

In [44]:
print(df.iloc[1:3])

   First_Col  Sec_Col  Third_Col  Fourth_Col
b          2        5          7           9
c          3        6          9          12

In [45]:
print(df.iloc[:3])

   First_Col  Sec_Col  Third_Col  Fourth_Col
a          1        4          5           6
b          2        5          7           9
c          3        6          9          12

In [46]:
# Append DataFrames

In [52]:
data1 = [[1,2], [3,4]]
data2 = [[5,6], [7,8]]

df1 = pd.DataFrame(data1, columns = ['a', 'b'], index = [0, 1])
df2 = pd.DataFrame(data2, columns = ['a', 'b'], index = [2, 3])

print(df1)
print(df2)

   a  b
0  1  2
1  3  4
   a  b
2  5  6
3  7  8

In [53]:
df3 = df1.append(df2)
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [54]:
import numpy as np

In [58]:
s = pd.Series(np.random.randn(5))
print(s)

0    0.242933
1    0.214618
2    0.643573
3   -0.681990
4   -1.044617
dtype: float64

In [59]:
print(s.empty)

False

In [61]:
df = pd.DataFrame(np.random.rand(4,3), columns = ['col1', 'col2', 'col3'])

In [62]:
df

       col1      col2      col3
0  0.122440  0.449960  0.689938
1  0.003140  0.524295  0.462048
2  0.306103  0.794198  0.449640
3  0.829728  0.552318  0.907820

In [63]:
df.ndim

2

In [64]:
df.size

12

In [65]:
df.dtypes

col1    float64
col2    float64
col3    float64
dtype: object

In [66]:
# CSV Files

In [67]:
df = pd.read_csv('datasets/daily-bike-share.csv')
df

,day,mnth,year,season,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,rentals
0,1,1,2011,1,0,6,0,2,0.344167,0.363625,0.805833,0.160446,331
1,2,1,2011,1,0,0,0,2,0.363478,0.353739,0.696087,0.248539,131
2,3,1,2011,1,0,1,1,1,0.196364,0.189405,0.437273,0.248309,120
3,4,1,2011,1,0,2,1,1,0.200000,0.212122,0.590435,0.160296,108
4,5,1,2011,1,0,3,1,1,0.226957,0.229270,0.436957,0.186900,82
...,...,...,...,...,...,...,...,...,...,...,...,...,...
726,27,12,2012,1,0,4,1,2,0.254167,0.226642,0.652917,0.350133,247
727,28,12,2012,1,0,5,1,2,0.253333,0.255046,0.590000,0.155471,644
728,29,12,2012,1,0,6,0,2,0.253333,0.242400,0.752917,0.124383,159
729,30,12,2012,1,0,0,0,1,0.255833,0.231700,0.483333,0.350754,364
730,31,12,2012,1,0,1,1,2,0.215833,0.223487,0.577500,0.154846,439

In [71]:
df.index

RangeIndex(start=0, stop=731, step=1)

In [72]:
df.columns

Index(['day', 'mnth', 'year', 'season', 'holiday', 'weekday', 'workingday',
       'weathersit', 'temp', 'atemp', 'hum', 'windspeed', 'rentals'],
      dtype='object')

In [73]:
df['temp']

0      0.344167
1      0.363478
2      0.196364
3      0.200000
4      0.226957
         ...
726    0.254167
727    0.253333
728    0.253333
729    0.255833
730    0.215833
Name: temp, Length: 731, dtype: float64

In [74]:
df.temp

0      0.344167
1      0.363478
2      0.196364
3      0.200000
4      0.226957
         ...
726    0.254167
727    0.253333
728    0.253333
729    0.255833
730    0.215833
Name: temp, Length: 731, dtype: float64

In [75]:
df.head

<bound method NDFrame.head of      day  mnth  year  season  holiday  weekday  workingday  weathersit  \
0      1     1  2011       1        0        6           0           2
1      2     1  2011       1        0        0           0           2
2      3     1  2011       1        0        1           1           1
3      4     1  2011       1        0        2           1           1
4      5     1  2011       1        0        3           1           1
..   ...   ...   ...     ...      ...      ...         ...         ...
726   27    12  2012       1        0        4           1           2
727   28    12  2012       1        0        5           1           2
728   29    12  2012       1        0        6           0           2
729   30    12  2012       1        0        0           0           1
730   31    12  2012       1        0        1           1           2

         temp     atemp       hum  windspeed  rentals
0    0.344167  0.363625  0.805833   0.160446      331
1    0.363478  0.353739  0.696087   0.248539      131
2    0.196364  0.189405  0.437273   0.248309      120
3    0.200000  0.212122  0.590435   0.160296      108
4    0.226957  0.229270  0.436957   0.186900       82
..        ...       ...       ...        ...      ...
726  0.254167  0.226642  0.652917   0.350133      247
727  0.253333  0.255046  0.590000   0.155471      644
728  0.253333  0.242400  0.752917   0.124383      159
729  0.255833  0.231700  0.483333   0.350754      364
730  0.215833  0.223487  0.577500   0.154846      439

[731 rows x 13 columns]>

In [81]:
df.sample(10)

,day,mnth,year,season,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,rentals
551,5,7,2012,3,0,4,1,1,0.827500,0.761367,0.457917,0.194029,1405
630,22,9,2012,3,0,6,0,1,0.650000,0.610488,0.646667,0.283583,2512
724,25,12,2012,1,1,2,0,2,0.291304,0.294465,0.734783,0.168726,440
124,5,5,2011,2,0,4,1,1,0.459167,0.441917,0.444167,0.295392,614
457,2,4,2012,2,0,1,1,1,0.433913,0.427513,0.504348,0.312139,1208
587,10,8,2012,3,0,5,1,2,0.715833,0.667942,0.715833,0.238813,1065
95,6,4,2011,2,0,3,1,1,0.390833,0.387608,0.470833,0.263063,413
482,27,4,2012,2,0,5,1,1,0.457500,0.452637,0.400833,0.347633,1014
498,13,5,2012,2,0,0,0,1,0.612500,0.585238,0.576250,0.225117,2172
291,19,10,2011,4,0,3,1,3,0.541739,0.513848,0.895217,0.243339,254

In [82]:
df.tail

<bound method NDFrame.tail of      day  mnth  year  season  holiday  weekday  workingday  weathersit  \
0      1     1  2011       1        0        6           0           2
1      2     1  2011       1        0        0           0           2
2      3     1  2011       1        0        1           1           1
3      4     1  2011       1        0        2           1           1
4      5     1  2011       1        0        3           1           1
..   ...   ...   ...     ...      ...      ...         ...         ...
726   27    12  2012       1        0        4           1           2
727   28    12  2012       1        0        5           1           2
728   29    12  2012       1        0        6           0           2
729   30    12  2012       1        0        0           0           1
730   31    12  2012       1        0        1           1           2

         temp     atemp       hum  windspeed  rentals
0    0.344167  0.363625  0.805833   0.160446      331
1    0.363478  0.353739  0.696087   0.248539      131
2    0.196364  0.189405  0.437273   0.248309      120
3    0.200000  0.212122  0.590435   0.160296      108
4    0.226957  0.229270  0.436957   0.186900       82
..        ...       ...       ...        ...      ...
726  0.254167  0.226642  0.652917   0.350133      247
727  0.253333  0.255046  0.590000   0.155471      644
728  0.253333  0.242400  0.752917   0.124383      159
729  0.255833  0.231700  0.483333   0.350754      364
730  0.215833  0.223487  0.577500   0.154846      439

[731 rows x 13 columns]>

In [83]:
df.columns.size

13

In [84]:
df.index.size

731

In [85]:
df.shape

(731, 13)

In [86]:
df.ndim

2

In [88]:
df.describe()

,day,mnth,year,season,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,rentals
count,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000
mean,15.738714,6.519836,2011.500684,2.496580,0.028728,2.997264,0.683995,1.395349,0.495385,0.474354,0.627894,0.190486,848.176471
std,8.809949,3.451913,0.500342,1.110807,0.167155,2.004787,0.465233,0.544894,0.183051,0.162961,0.142429,0.077498,686.622488
min,1.000000,1.000000,2011.000000,1.000000,0.000000,0.000000,0.000000,1.000000,0.059130,0.079070,0.000000,0.022392,2.000000
25%,8.000000,4.000000,2011.000000,2.000000,0.000000,1.000000,0.000000,1.000000,0.337083,0.337842,0.520000,0.134950,315.500000
50%,16.000000,7.000000,2012.000000,3.000000,0.000000,3.000000,1.000000,1.000000,0.498333,0.486733,0.626667,0.180975,713.000000
75%,23.000000,10.000000,2012.000000,3.000000,0.000000,5.000000,1.000000,2.000000,0.655417,0.608602,0.730209,0.233214,1096.000000
max,31.000000,12.000000,2012.000000,4.000000,1.000000,6.000000,1.000000,3.000000,0.861667,0.840896,0.972500,0.507463,3410.000000

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731 entries, 0 to 730
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   day         731 non-null    int64
 1   mnth        731 non-null    int64
 2   year        731 non-null    int64
 3   season      731 non-null    int64
 4   holiday     731 non-null    int64
 5   weekday     731 non-null    int64
 6   workingday  731 non-null    int64
 7   weathersit  731 non-null    int64
 8   temp        731 non-null    float64
 9   atemp       731 non-null    float64
 10  hum         731 non-null    float64
 11  windspeed   731 non-null    float64
 12  rentals     731 non-null    int64
dtypes: float64(4), int64(9)
memory usage: 74.4 KB

In [90]:
df['day'].sum()

11505

In [91]:
df['day'].mean()

15.738714090287278

In [92]:
df['day'].std()

8.8099487964588

In [93]:
df['day'].min()

1

In [95]:
df['day'].max()

31

In [96]:
# Pandas Sorting

In [99]:
unsorted_df = pd.DataFrame(np.random.randn(10,2), index = [1,4,6,2,3,5,9,8,0,7], columns = ['col1', 'col2'])

In [100]:
unsorted_df

       col1      col2
1  0.279605 -1.145239
4  1.194203 -0.345077
6 -0.308699  1.431751
2 -0.659946  2.652968
3  2.934714 -0.882940
5  0.684022 -0.441345
9  0.526538  1.119227
8  0.511296 -0.371643
0 -0.782680  0.078548
7  1.091491  1.060550

In [101]:
sorted_df = unsorted_df.sort_index()

In [102]:
sorted_df

       col1      col2
0 -0.782680  0.078548
1  0.279605 -1.145239
2 -0.659946  2.652968
3  2.934714 -0.882940
4  1.194203 -0.345077
5  0.684022 -0.441345
6 -0.308699  1.431751
7  1.091491  1.060550
8  0.511296 -0.371643
9  0.526538  1.119227

In [103]:
sorted_df = unsorted_df.sort_index(ascending = False)
sorted_df

       col1      col2
9  0.526538  1.119227
8  0.511296 -0.371643
7  1.091491  1.060550
6 -0.308699  1.431751
5  0.684022 -0.441345
4  1.194203 -0.345077
3  2.934714 -0.882940
2 -0.659946  2.652968
1  0.279605 -1.145239
0 -0.782680  0.078548

In [104]:
# Merge Sort
# Heap Sort
# Quick Sort

In [106]:
unsorted_df = pd.DataFrame({'col1': [2,1,1,1], 'col2': [1,3,2,4]})
unsorted_df

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4

In [107]:
sorted_df = unsorted_df.sort_values(by = 'col1', kind = 'mergesort')
sorted_df

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1